// DO NOT EDIT! Data source is chemical_elements.csv (converted by github.com/fleschutz/csv2hpp 0.2 on 2026-02-03)
#pragma once
#include <SI/literals.h>
using namespace SI;

namespace dataset { 

struct element_data {
/*01*/   short atomic_number;		// (short)
/*02*/   const char* symbol;		// (string)
/*03*/   const char* name;		// (string)
/*04*/   int group;		// (int)
/*05*/   int period;		// (int)
/*08*/   SI::mass atomic_mass;		// (_Da)
/*13*/   SI::temperature melting_point;		// (_degC)
/*14*/   SI::temperature boiling_point;		// (_degC)
/*18*/   SI::length atomic_radius;		// (_pm)
/*19*/   SI::length covalent_radius;		// (_pm)
/*20*/   SI::length VanDerWaals_radius;		// (_pm)
/*29*/   bool radioactive;		// (bool)
};

const element_data elements[] { // NOTE: 00=empty or unknown field
{1,"H","Hydrogen",1,1,1.008_Da,14.01_degC,20.28_degC,53_pm,38_pm,120_pm,false},
{2,"He","Helium",18,1,4.002602_Da,00_degC,4.22_degC,31_pm,32_pm,140_pm,false},
{3,"Li","Lithium",1,2,6.94_Da,453.69_degC,1560_degC,167_pm,134_pm,182_pm,false},
{4,"Be","Beryllium",2,2,9.0121831_Da,1560_degC,2742_degC,112_pm,90_pm,153_pm,false},
{5,"B","Boron",13,2,10.81_Da,2349_degC,4200_degC,87_pm,82_pm,192_pm,false},
{6,"C","Carbon",14,2,12.011_Da,3800_degC,4300_degC,67_pm,77_pm,170_pm,false},
{7,"N","Nitrogen",15,2,14.007_Da,63.15_degC,77.36_degC,56_pm,75_pm,155_pm,false},
{8,"O","Oxygen",16,2,15.999_Da,54.36_degC,90.2_degC,48_pm,73_pm,152_pm,false},
{9,"F","Fluorine",17,2,18.99840316_Da,53.53_degC,85.03_degC,42_pm,71_pm,147_pm,false},
{10,"Ne","Neon",18,2,20.1797_Da,24.56_degC,27.07_degC,38_pm,69_pm,154_pm,false},
{11,"Na","Sodium",1,3,22.98976928_Da,370.87_degC,1156_degC,190_pm,154_pm,227_pm,false},
{12,"Mg","Magnesium",2,3,24.305_Da,923_degC,1363_degC,145_pm,130_pm,173_pm,false},
{13,"Al","Aluminium",13,3,26.9815385_Da,933.47_degC,2792_degC,118_pm,118_pm,184_pm,false},
{14,"Si","Silicon",14,3,28.085_Da,1687_degC,3538_degC,111_pm,111_pm,210_pm,false},
{15,"P","Phosphorus",15,3,30.973762_Da,317.3_degC,550_degC,98_pm,106_pm,180_pm,false},
{16,"S","Sulfur",16,3,32.06_Da,388.36_degC,717.87_degC,88_pm,102_pm,180_pm,false},
{17,"Cl","Chlorine",17,3,35.45_Da,171.6_degC,239.11_degC,79_pm,99_pm,175_pm,false},
{18,"Ar","Argon",18,3,39.948_Da,83.8_degC,87.3_degC,71_pm,97_pm,188_pm,false},
{19,"K","Potassium",1,4,39.0983_Da,336.53_degC,1032_degC,243_pm,196_pm,275_pm,false},
{20,"Ca","Calcium",2,4,40.078_Da,1115_degC,1757_degC,194_pm,174_pm,231_pm,false},
{21,"Sc","Scandium",3,4,44.955908_Da,1814_degC,3109_degC,184_pm,144_pm,211_pm,false},
{22,"Ti","Titanium",4,4,47.867_Da,1941_degC,3560_degC,176_pm,136_pm,00_pm,false},
{23,"V","Vanadium",5,4,50.9415_Da,2183_degC,3680_degC,171_pm,125_pm,00_pm,false},
{24,"Cr","Chromium",6,4,51.9961_Da,2180_degC,2944_degC,166_pm,127_pm,00_pm,false},
{25,"Mn","Manganese",7,4,54.938044_Da,1519_degC,2334_degC,161_pm,139_pm,00_pm,false},
{26,"Fe","Iron",8,4,55.845_Da,1811_degC,3134_degC,156_pm,125_pm,00_pm,false},
{27,"Co","Cobalt",9,4,58.933194_Da,1768_degC,3200_degC,152_pm,126_pm,00_pm,false},
{28,"Ni","Nickel",10,4,58.6934_Da,1728_degC,3186_degC,149_pm,121_pm,163_pm,false},
{29,"Cu","Copper",11,4,63.546_Da,1357.77_degC,2835_degC,145_pm,138_pm,140_pm,false},
{30,"Zn","Zinc",12,4,65.38_Da,692.88_degC,1180_degC,142_pm,131_pm,139_pm,false},
{31,"Ga","Gallium",13,4,69.723_Da,302.9146_degC,2673_degC,136_pm,126_pm,187_pm,false},
{32,"Ge","Germanium",14,4,72.63_Da,1211.4_degC,3106_degC,125_pm,122_pm,211_pm,false},
{33,"As","Arsenic",15,4,74.921595_Da,1090_degC,887_degC,114_pm,119_pm,185_pm,false},
{34,"Se","Selenium",16,4,78.971_Da,453_degC,958_degC,103_pm,116_pm,190_pm,false},
{35,"Br","Bromine",17,4,79.904_Da,265.8_degC,332_degC,94_pm,114_pm,185_pm,false},
{36,"Kr","Krypton",18,4,83.798_Da,115.79_degC,119.93_degC,88_pm,110_pm,202_pm,false},
{37,"Rb","Rubidium",1,5,85.4678_Da,312.46_degC,961_degC,265_pm,211_pm,303_pm,false},
{38,"Sr","Strontium",2,5,87.62_Da,1050_degC,1655_degC,219_pm,192_pm,249_pm,false},
{39,"Y","Yttrium",3,5,88.90584_Da,1799_degC,3609_degC,212_pm,162_pm,00_pm,false},
{40,"Zr","Zirconium",4,5,91.224_Da,2128_degC,4682_degC,206_pm,148_pm,00_pm,false},
{41,"Nb","Niobium",5,5,92.90637_Da,2750_degC,5017_degC,198_pm,137_pm,00_pm,false},
{42,"Mo","Molybdenum",6,5,95.95_Da,2896_degC,4912_degC,190_pm,145_pm,00_pm,false},
{43,"Tc","Technetium",7,5,98_Da,2430_degC,4538_degC,183_pm,156_pm,00_pm,true},
{44,"Ru","Ruthenium",8,5,101.07_Da,2607_degC,4423_degC,178_pm,126_pm,00_pm,false},
{45,"Rh","Rhodium",9,5,102.9055_Da,2237_degC,3968_degC,173_pm,135_pm,00_pm,false},
{46,"Pd","Palladium",10,5,106.42_Da,1828.05_degC,3236_degC,169_pm,131_pm,163_pm,false},
{47,"Ag","Silver",11,5,107.8682_Da,1234.93_degC,2435_degC,165_pm,153_pm,172_pm,false},
{48,"Cd","Cadmium",12,5,112.414_Da,594.22_degC,1040_degC,161_pm,148_pm,158_pm,false},
{49,"In","Indium",13,5,114.818_Da,429.75_degC,2345_degC,156_pm,144_pm,193_pm,false},
{50,"Sn","Tin",14,5,118.71_Da,505.08_degC,2875_degC,145_pm,141_pm,217_pm,false},
{51,"Sb","Antimony",15,5,121.76_Da,903.78_degC,1860_degC,133_pm,138_pm,206_pm,false},
{52,"Te","Tellurium",16,5,127.6_Da,722.66_degC,1261_degC,123_pm,135_pm,206_pm,false},
{53,"I","Iodine",17,5,126.90447_Da,386.85_degC,457.4_degC,115_pm,133_pm,198_pm,false},
{54,"Xe","Xenon",18,5,131.293_Da,161.4_degC,165.03_degC,108_pm,130_pm,216_pm,false},
{55,"Cs","Caesium",1,6,132.905452_Da,301.59_degC,944_degC,298_pm,225_pm,343_pm,false},
{56,"Ba","Barium",2,6,137.327_Da,1000_degC,2170_degC,253_pm,198_pm,268_pm,false},
{57,"La","Lanthanum",3,6,138.90547_Da,1193_degC,3737_degC,195_pm,169_pm,00_pm,false},
{58,"Ce","Cerium",00,6,140.116_Da,1068_degC,3716_degC,158_pm,00_pm,00_pm,false},
{59,"Pr","Praseodymium",00,6,140.90766_Da,1208_degC,3793_degC,247_pm,00_pm,00_pm,false},
{60,"Nd","Neodymium",00,6,144.242_Da,1297_degC,3347_degC,206_pm,00_pm,00_pm,false},
{61,"Pm","Promethium",00,6,145_Da,1315_degC,3273_degC,205_pm,00_pm,00_pm,true},
{62,"Sm","Samarium",00,6,150.36_Da,1345_degC,2067_degC,238_pm,00_pm,00_pm,false},
{63,"Eu","Europium",00,6,151.964_Da,1099_degC,1802_degC,231_pm,00_pm,00_pm,false},
{64,"Gd","Gadolinium",00,6,157.25_Da,1585_degC,3546_degC,233_pm,00_pm,00_pm,false},
{65,"Tb","Terbium",00,6,158.92535_Da,1629_degC,3503_degC,225_pm,00_pm,00_pm,false},
{66,"Dy","Dysprosium",00,6,162.5_Da,1680_degC,2840_degC,228_pm,00_pm,00_pm,false},
{67,"Ho","Holmium",00,6,164.93033_Da,1734_degC,2993_degC,226_pm,00_pm,00_pm,false},
{68,"Er","Erbium",00,6,167.259_Da,1802_degC,3141_degC,226_pm,00_pm,00_pm,false},
{69,"Tm","Thulium",00,6,168.93422_Da,1818_degC,2223_degC,222_pm,00_pm,00_pm,false},
{70,"Yb","Ytterbium",00,6,173.045_Da,1097_degC,1469_degC,222_pm,00_pm,00_pm,false},
{71,"Lu","Lutetium",00,6,174.9668_Da,1925_degC,3675_degC,217_pm,160_pm,00_pm,false},
{72,"Hf","Hafnium",4,6,178.49_Da,2506_degC,4876_degC,208_pm,150_pm,00_pm,false},
{73,"Ta","Tantalum",5,6,180.94788_Da,3290_degC,5731_degC,200_pm,138_pm,00_pm,false},
{74,"W","Tungsten",6,6,183.84_Da,3695_degC,5828_degC,193_pm,146_pm,00_pm,false},
{75,"Re","Rhenium",7,6,186.207_Da,3459_degC,5869_degC,188_pm,159_pm,00_pm,false},
{76,"Os","Osmium",8,6,190.23_Da,3306_degC,5285_degC,185_pm,128_pm,00_pm,false},
{77,"Ir","Iridium",9,6,192.217_Da,2719_degC,4701_degC,180_pm,137_pm,00_pm,false},
{78,"Pt","Platinum",10,6,195.084_Da,2041.4_degC,4098_degC,177_pm,128_pm,175_pm,false},
{79,"Au","Gold",11,6,196.966569_Da,1337.33_degC,3129_degC,174_pm,144_pm,166_pm,false},
{80,"Hg","Mercury",12,6,200.592_Da,234.43_degC,629.88_degC,171_pm,149_pm,155_pm,false},
{81,"Tl","Thallium",13,6,204.38_Da,577_degC,1746_degC,156_pm,148_pm,196_pm,false},
{82,"Pb","Lead",14,6,207.2_Da,600.61_degC,2022_degC,154_pm,147_pm,202_pm,false},
{83,"Bi","Bismuth",15,6,208.9804_Da,544.7_degC,1837_degC,143_pm,146_pm,207_pm,false},
{84,"Po","Polonium",16,6,209_Da,527_degC,1235_degC,135_pm,00_pm,197_pm,true},
{85,"At","Astatine",17,6,210_Da,575_degC,610_degC,127_pm,00_pm,202_pm,true},
{86,"Rn","Radon",18,6,222_Da,202_degC,211.3_degC,120_pm,145_pm,220_pm,true},
{87,"Fr","Francium",1,7,223_Da,300_degC,950_degC,00_pm,00_pm,348_pm,true},
{88,"Ra","Radium",2,7,226_Da,973_degC,2010_degC,00_pm,00_pm,283_pm,true},
{89,"Ac","Actinium",3,7,227_Da,1323_degC,3471_degC,00_pm,00_pm,00_pm,true},
{90,"Th","Thorium",00,7,232.0377_Da,2115_degC,5061_degC,00_pm,00_pm,00_pm,true},
{91,"Pa","Protactinium",00,7,231.03588_Da,1841_degC,4300_degC,00_pm,00_pm,00_pm,true},
{92,"U","Uranium",00,7,238.02891_Da,1405.3_degC,4404_degC,00_pm,00_pm,186_pm,true},
{93,"Np","Neptunium",00,7,237_Da,917_degC,4273_degC,00_pm,00_pm,00_pm,true},
{94,"Pu","Plutonium",00,7,244_Da,912.5_degC,3501_degC,00_pm,00_pm,00_pm,true},
{95,"Am","Americium",00,7,243_Da,1449_degC,2880_degC,00_pm,00_pm,00_pm,true},
{96,"Cm","Curium",00,7,247_Da,1613_degC,3383_degC,00_pm,00_pm,00_pm,true},
{97,"Bk","Berkelium",00,7,247_Da,1259_degC,2900_degC,00_pm,00_pm,00_pm,true},
{98,"Cf","Californium",00,7,251_Da,1173_degC,1743_degC,00_pm,00_pm,00_pm,true},
{99,"Es","Einsteinium",00,7,252_Da,1133_degC,1269_degC,00_pm,00_pm,00_pm,true},
{100,"Fm","Fermium",00,7,257_Da,1125_degC,00_degC,00_pm,00_pm,00_pm,true},
{101,"Md","Mendelevium",00,7,258_Da,1100_degC,00_degC,00_pm,00_pm,00_pm,true},
{102,"No","Nobelium",00,7,259_Da,1100_degC,00_degC,00_pm,00_pm,00_pm,true},
{103,"Lr","Lawrencium",00,7,266_Da,1900_degC,00_degC,00_pm,00_pm,00_pm,true},
{104,"Rf","Rutherfordium",4,7,267_Da,2400_degC,5800_degC,00_pm,00_pm,00_pm,true},
{105,"Db","Dubnium",5,7,268_Da,00_degC,00_degC,00_pm,00_pm,00_pm,true},
{106,"Sg","Seaborgium",6,7,269_Da,00_degC,00_degC,00_pm,00_pm,00_pm,true},
{107,"Bh","Bohrium",7,7,270_Da,00_degC,00_degC,00_pm,00_pm,00_pm,true},
{108,"Hs","Hassium",8,7,277_Da,00_degC,00_degC,00_pm,00_pm,00_pm,true},
{109,"Mt","Meitnerium",9,7,278_Da,00_degC,00_degC,00_pm,00_pm,00_pm,true},
{110,"Ds","Darmstadtium",10,7,281_Da,00_degC,00_degC,00_pm,00_pm,00_pm,true},
{111,"Rg","Roentgenium",11,7,282_Da,00_degC,00_degC,00_pm,00_pm,00_pm,true},
{112,"Cn","Copernicium",12,7,285_Da,00_degC,357_degC,00_pm,00_pm,00_pm,true},
{113,"Nh","Nihonium",13,7,286_Da,700_degC,1400_degC,00_pm,00_pm,00_pm,true},
{114,"Fl","Flerovium",14,7,289_Da,00_degC,210_degC,00_pm,00_pm,00_pm,true},
{115,"Mc","Moscovium",15,7,290_Da,700_degC,1400_degC,00_pm,00_pm,00_pm,true},
{116,"Lv","Livermorium",16,7,293_Da,709_degC,1085_degC,00_pm,00_pm,00_pm,true},
{117,"Ts","Tennessine",17,7,294_Da,723_degC,883_degC,00_pm,00_pm,00_pm,true},
{118,"Og","Oganesson",18,7,294_Da,00_degC,350_degC,00_pm,00_pm,00_pm,true},
}; // (30 columns x 118 rows = 3540 cells)

} // namespace dataset

